//      bai tap 1
//
//     ┌────────────────────────┐
//     │
//     │    khoi tao gan gia tri│
//     │                        │
//     │  let min = arr[0];     │
//     │    let max =│arr[0];   │
//     │    let minIndex = 0;   │
//     │    let maxIndex = 0;   │
//     └───────────┬────────────┘
//                 │
//      ┌──────────▼─────────────────────────►
//      │ for (let i = 1; i < numberslength
//      │               i++)                 │
//      │                                    │
//      │                                    │
//      │                                    │
//      │                                    │
//      └───────────┬────────────────────────┘
//                  │
//      ┌─────────────────────────────────────┐
//      │                                     │
//      │  if (numbers[i] > max) {            │
//      │          max = numbers[i];          │
//      │          maxIndex = i;              │
//      │      }                              │
//      │      if (numbers[i] < min) {        │
//      │          min = numbers[i];          │
//      │          minIndex = i;              │
//      │      }                              │
//      │                                     │
//      └───────────────┬─────────────────────┘
//                      │
//                      │
//                      ▼
//      ┌─────────────────────────────────────────┐
//      │                                         │
//      │    In ra:                               │
//      │         "Min =", min, "at", minIndex
//      │         "Max =", max, "at", maxIndex
//      │                                         │
//      └─────────────────────────────────────────┘
let numbers = [5, 2, 8, 1, 6];
let max = numbers[0];
let min = numbers[0];
let maxIndex = 0;
let minIndex = 0;

for (let i = 1; i < numbers.length; i++) {
    if (numbers[i] > max) {
        max = numbers[i];
        maxIndex = i;
    }
    if (numbers[i] < min) {
        min = numbers[i];
        minIndex = i;
    }
}
console.log("Số lớn nhất là:", max, "ở vị trí:", maxIndex);
console.log("Số nhỏ nhất là:", min, "ở vị trí:", minIndex);
// bai tap 3
//
//          ┌─────────────────────────────────────────────┐
//          │     tao bien gan gia tri                    │
//          │                                             │
//          │    const arr   = [1, 2, 3, 2, 4];           │
//          │    const result = [];                       ┼──────────────────┐
//          │                                             │                  │
//          └─────────────────────────────────────────────┘                  │
//                                                                           │
//                                                                           │
//                                                                           │
//                                                                           │
//                                                                           │
//                                                                           │
//                                                                           │
//                                                                           ▼
//          ┌────────────────────────────────────┐          ┌──────────────── ──────────────────────────┐
//          │                                    │          │   for (let i = 0; i < arr.length; i++)    │
//          │   let j = 0; j < result.length; j++│          │                                           │
//          │                                    │          │    ┌──────────────────────────┐           │
//          │      arr[i] === result[j]          │◄─────────┼    │  let duplicate = false;  │           │
//          │                                    │          │    └──────────────────────────┘           │
//          │      duplicate = true;             │          │                                           │
//          │                  break;            │          │                                           │
//          └────────────────────────────────────┘          └─────────────────┬─────────────────────────┘
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            │
//                                                                            ▼
//                                                          ┌───────────────── ──────────────┐
//          ┌──────────────────────────────────┐            │                                │
//          │                                  │            │      duplicate === false       │
//          │  console.log(result);            │ ◄──────────┤      result.push(arr[i])       │
//          │                                  │            └────────────────────────────────┘
//          └──────────────────────────────────┘
//
//
//
const arr = [1, 2, 3, 2, 4];
const result = [];

for (let i = 0; i < arr.length; i++) {
    let duplicate = false;

    for (let j = 0; j < result.length; j++) {
        if (arr[i] === result[j]) {
            duplicate = true;
            break;
        }
    }

    if (duplicate === false) {
        result.push(arr[i]);
    }
}

console.log(result);
// bài tập 4
//                                                            buoc 2
//            buoc1
//         ┌───────────────────────────┐                     ┌─────────────────────────────────┐
//         │   tao bien                │                     │                                 │
//         │   let a = [7, 5, 1, 3, 6];│                     │       let location = a.length   │
//         └─────────┬─────────────────┘                     └─────────────┬───────────────────┘
//                   │                                                     │
//                   │                                                     │
//         ┌─────────▼────────────────┐                                    │
//         │                          │                                    │
//         │ a.sort((a, b) => a - b)  │                                    │
//         └─────────┬────────────────┘                                    ▼
//                   │                                       ┌──────────────────────────────────┐
//                   │                                       │                                  │
//         ┌─────────▼──────────────────────────────┐        │     let i = 0; i < a.length; i++ │
//         │                                        │        │                                  │
//         │     Nếu a - b < 0 → a đứng trước b.    │        └──────────────┬───────────────────┘
//         │                                        │                       │
//         │     Nếu a - b > 0 → b đứng trước a.    │                       │
//         │                                        │                       │
//         │     Nếu a - b === 0 → giữ nguyên thứ tự.                       │
//         │                                        │        ┌──────────────▼───────────────────────┐
//         └─────────▲──────────────────────────────┘        │   b <= a[i]       neu b=2            │
//                   │                                       │   location = i;    2 <= 1 Không đúng │
//                   │                                       │          break;    2 <= 2 Đúng       │
//                   │                                       │                     │                │
//          ┌────────▼─────────────────┐                     │                     ▼                │
//          │    console.log(a);       │                     │                    location = 2      │
//          │                          │                     └──────────────┬───────────────────────┘
//          └──────────────────────────┘                                    ▼
//                                                           ┌──────────────────────────────────────┐
//                                                           │     a.splice(location, 0, b);        │
//                                                           │                                      │
//                                                           └──────────────┬───────────────────────┘
//                                                                          ▼
//                                                            ┌─────────────────────────────────────┐
//                                                            │   console.log("bước 2:", a)         │
//                                                            │                                     │
//                                                            └─────────────────────────────────────┘
//
//
let a = [7, 5, 1, 3, 6];
let b = 2;

a.sort((a, b) => a - b);

console.log(a);
let location = a.length; // gán giá trị chèn vào cuối nếu không tìm được vị trí phù hợp.

for (let i = 0; i < a.length; i++) {
    if (b <= a[i]) {
        location = i;
        break;
    }
}

a.splice(location, 0, b);

console.log("bước 2:", a);
